In [25]:
import pandas as pd
import numpy as np

sale_train = pd.read_csv('sales_train.csv')
test = pd.read_csv('test.csv')
sale_train.head()

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0

In [20]:
test.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [17]:
data.isnull().sum()

date              0
date_block_num    0
shop_id           0
item_id           0
item_price        0
item_cnt_day      0
dtype: int64

In [26]:
sale_train_fil = sale_train[sale_train['date_block_num'] ==33]
sale_train_fil.head()

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day
2882335,23.10.2015,33,45,13315,649.0,1.0
2882336,05.10.2015,33,45,13880,229.0,1.0
2882337,02.10.2015,33,45,13881,659.0,1.0
2882338,12.10.2015,33,45,13881,659.0,1.0
2882339,04.10.2015,33,45,13923,169.0,1.0

In [52]:
sale_group = sale_train_fil[['shop_id', 'item_id','item_cnt_day']].groupby(['shop_id','item_id']).agg({'item_cnt_day':'sum'}).reset_index()
sale_group =sale_group.rename(columns={'item_cnt_day': 'item_cnt_month'})
sale_group.head()

   shop_id  item_id  item_cnt_month
0        2       31             1.0
1        2      486             3.0
2        2      787             1.0
3        2      794             1.0
4        2      968             1.0

In [56]:
test = pd.read_csv('test.csv')
test = pd.merge(test,sale_group, on = ['shop_id','item_id'],how ='left')
print(test.head())

   ID  shop_id  item_id  item_cnt_month
0   0        5     5037             NaN
1   1        5     5320             NaN
2   2        5     5233             1.0
3   3        5     5232             NaN
4   4        5     5268             NaN

In [57]:
test['item_cnt_month'] = test['item_cnt_month'].fillna(0).clip(0,20)
print(test.head())

   ID  shop_id  item_id  item_cnt_month
0   0        5     5037             0.0
1   1        5     5320             0.0
2   2        5     5233             1.0
3   3        5     5232             0.0
4   4        5     5268             0.0

In [58]:
test = test[['ID', 'item_cnt_month']]
submission = test.set_index('ID')

In [59]:
submission.to_csv('submission_baseline.csv')